app/mailers/user_mailer.rb

  def welcome_email(email)
    #.order(create_at: :desc) 找最后生成的数据
    validation_code = ValidationCode.order(create_at: :desc).find_by_email(email)
---
SELECT "validation_codes".* FROM "validation_codes" WHERE "validation_codes"."email" = $1 ORDER BY "create_at" DESC LIMIT $2  [["email", "350944364@qq.com"], ["LIMIT", 1]]