app/controllers/api/v1/validation_codes_controller.rb

  def create
    if ValidationCode.exists?(
      email: params[:email],
      kind: "sign_in",
      created_at: 1.minute.ago..Time.now,
    )
      render status: :too_many_requests
      return
    end
    validation_code = ValidationCode.new email: params[:email], kind: "sign_in"
    if validation_code.save
---
SELECT "validation_codes".* FROM "validation_codes" WHERE "validation_codes"."email" = $1 ORDER BY "validation_codes"."created_at" DESC LIMIT $2  [["email", "anwenteng@foxmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "validation_codes" WHERE "validation_codes"."email" = $1 AND "validation_codes"."kind" = $2 AND "validation_codes"."created_at" BETWEEN $3 AND $4 LIMIT $5  [["email", "350944364@qq.com"], ["kind", 0], ["created_at", "2022-09-06 15:06:18.923688"], ["created_at", "2022-09-06 15:07:18.923754"], ["LIMIT", 1]]
INSERT INTO "validation_codes" ("email", "kind", "code", "used_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "350944364@qq.com"], ["kind", 0], ["code", "205654"], ["used_at", nil], ["created_at", "2022-09-06 15:07:18.934536"], ["updated_at", "2022-09-06 15:07:18.934536"]]